01 WS-LEDGER-ENTRY.
   05 LE-PAY-PERIOD               PIC X(8).
   05 LE-EMP-ID                   PIC 9(6).
   05 LE-ACCOUNT-CODE             PIC X(6).
   05 LE-DEBIT-AMOUNT             PIC 9(7)V99 COMP-3.
   05 LE-CREDIT-AMOUNT            PIC 9(7)V99 COMP-3.